var userInfo = JSON.parse(getItem("WxUserInfo")),
    age = 23,
    chartAge = 8;
if (userInfo) {
    age = parseInt(userInfo.age)
}
if (age <= 22) {
    chartAge = 0
} else if (age >= 80) {
    chartAge = 59
} else {
    chartAge = age - 22
}

var apiPoint = [age, parseInt(api)];
var aviPoint = [age, parseInt(avi)];

console.log(age, avi, api)
var dataAVI = {
    middle: [
        ['≤22', 13],
        ['23', 13],
        ['24', 13.5],
        ['25', 13.5],
        ['26', 14],
        ['27', 14.5],
        ['28', 14.5],
        ['29', 15],
        ['30', 15],
        ['31', 15],
        ['32', 15],
        ['33', 15],
        ['34', 15.5],
        ['35', 15.5],
        ['36', 16],
        ['37', 16],
        ['38', 16.5],
        ['39', 16.5],
        ['40', 17],
        ['41', 17.5],
        ['42', 17.5],
        ['43', 17.5],
        ['44', 18.5],
        ['45', 18.5],
        ['46', 18.5],
        ['47', 19],
        ['48', 19.5],
        ['49', 19.5],
        ['50', 20],
        ['51', 20],
        ['52', 20],
        ['53', 21],
        ['54', 21],
        ['55', 21.5],
        ['56', 21.5],
        ['57', 22],
        ['58', 22.5],
        ['59', 22.5],
        ['60', 23],
        ['61', 23.5],
        ['62', 24],
        ['63', 24],
        ['64', 25],
        ['65', 25],
        ['66', 25.5],
        ['67', 26],
        ['68', 26.5],
        ['69', 27],
        ['70', 27.5],
        ['71', 27.5],
        ['72', 27.5],
        ['73', 28.5],
        ['74', 29],
        ['75', 29],
        ['76', 29.5],
        ['77', 31.5],
        ['78', 31.5],
        ['79', 32.5],
        ['≥80', 33],
    ],
    high: [
        ['≤22', 15],
        ['23', 15],
        ['24', 16],
        ['25', 16],
        ['26', 16],
        ['27', 17],
        ['28', 17],
        ['29', 18],
        ['30', 18],
        ['31', 18],
        ['32', 18],
        ['33', 18],
        ['34', 18],
        ['35', 18],
        ['36', 19],
        ['37', 19],
        ['38', 20],
        ['39', 20],
        ['40', 20],
        ['41', 21],
        ['42', 21],
        ['43', 21],
        ['44', 22],
        ['45', 22],
        ['46', 22],
        ['47', 23],
        ['48', 23],
        ['49', 23],
        ['50', 24],
        ['51', 24],
        ['52', 24],
        ['53', 25],
        ['54', 25],
        ['55', 26],
        ['56', 26],
        ['57', 26],
        ['58', 27],
        ['59', 27],
        ['60', 28],
        ['61', 28],
        ['62', 29],
        ['63', 29],
        ['64', 30],
        ['65', 30],
        ['66', 31],
        ['67', 31],
        ['68', 32],
        ['69', 32],
        ['70', 33],
        ['71', 33],
        ['72', 33],
        ['73', 34],
        ['74', 35],
        ['75', 35],
        ['76', 36],
        ['77', 37],
        ['78', 37],
        ['79', 38],
        ['≥80', 39],
    ],
}
var dataAPI = {
    middle: [
        ['≤22', 18.5],
        ['23', 18.5],
        ['24', 18.5],
        ['25', 18.5],
        ['26', 18.5],
        ['27', 19.5],
        ['28', 19.5],
        ['29', 19.5],
        ['30', 19.5],
        ['31', 19.5],
        ['32', 19.5],
        ['33', 20],
        ['34', 20],
        ['35', 20],
        ['36', 20],
        ['37', 20.5],
        ['38', 21],
        ['39', 21],
        ['40', 21],
        ['41', 21],
        ['42', 21],
        ['43', 21],
        ['44', 21.5],
        ['45', 22],
        ['46', 22],
        ['47', 22],
        ['48', 22.5],
        ['49', 22.5],
        ['50', 22.5],
        ['51', 22.5],
        ['52', 22.5],
        ['53', 22.5],
        ['54', 22.5],
        ['55', 23],
        ['56', 23.5],
        ['57', 23.5],
        ['58', 23.5],
        ['59', 24],
        ['60', 24],
        ['61', 24],
        ['62', 24.5],
        ['63', 25],
        ['64', 25],
        ['65', 25],
        ['66', 25],
        ['67', 25.5],
        ['68', 25.5],
        ['69', 26],
        ['70', 26],
        ['71', 26],
        ['72', 26.5],
        ['73', 26.5],
        ['74', 26.5],
        ['75', 26.5],
        ['76', 26.5],
        ['77', 27],
        ['78', 27.5],
        ['79', 27.5],
        ['≥80', 27.5],
    ],
    high: [
        ['≤22', 22],
        ['23', 22],
        ['24', 22],
        ['25', 22],
        ['26', 22],
        ['27', 23],
        ['28', 23],
        ['29', 23],
        ['30', 23],
        ['31', 23],
        ['32', 23],
        ['33', 24],
        ['34', 24],
        ['35', 24],
        ['36', 24],
        ['37', 24],
        ['38', 25],
        ['39', 25],
        ['40', 25],
        ['41', 25],
        ['42', 25],
        ['43', 25],
        ['44', 26],
        ['45', 26],
        ['46', 26],
        ['47', 26],
        ['48', 27],
        ['49', 27],
        ['50', 27],
        ['51', 27],
        ['52', 27],
        ['53', 27],
        ['54', 27],
        ['55', 28],
        ['56', 28],
        ['57', 28],
        ['58', 28],
        ['59', 29],
        ['60', 29],
        ['61', 29],
        ['62', 29],
        ['63', 30],
        ['64', 30],
        ['65', 30],
        ['66', 30],
        ['67', 31],
        ['68', 31],
        ['69', 31],
        ['70', 31],
        ['71', 31],
        ['72', 32],
        ['73', 32],
        ['74', 32],
        ['75', 32],
        ['76', 32],
        ['77', 32],
        ['78', 33],
        ['79', 33],
        ['≥80', 33],
    ],
}
var optionAVI = {
    title: {
        text: '动脉脉搏波速率指数',
        left: "left",
    },
    xAxis: {
        type: 'value',
        name: "年龄/岁",
        axisLine: {
            onZero: true
        },
        min: "20"
    },
    yAxis: {
        type: 'value',
        name: 'AVI值',
        max: 60
    },
    tooltip: {
        // trigger: "axis",
        // axisPointer: {
        //     animation: false
        // }
        formatter: "动脉脉搏波速率指数avi:" + avi
    },
    legend: {
        data: ["平均值", "上限值"],
        x: "right"
    },
    // toolbox: {
    //     feature: {
    //         saveAsImage: {}
    //     }
    // },
    axisPointer: {
        link: {
            xAxisIndex: "all"
        }
    },
    grid: [{
        left: 50,
        right: 60,
        top: 50,
        bottom: 60
    }],
    series: [{
        // markPoint: {
        //     data: [{
        //         name: '当前',
        //         value: dataAVI.middle[chartAge][1],
        //         xAxis: dataAVI.middle[chartAge][0],
        //         yAxis: dataAVI.middle[chartAge][1]
        //     }, ]
        // },
        color: "green",
        name: "平均值",
        hoverAnimation: false,
        data: dataAVI.middle,
        symbol: 'none',
        type: 'line'
    },
    {
        color: "blue",
        name: "上限值",
        hoverAnimation: false,
        data: dataAVI.high,
        symbol: 'none',
        type: 'line'
    },
        // {
        //     symbolSize: 8,
        //     data: [aviPoint],
        //     color: "#0000ff",
        //     type: 'scatter'
        // }
    ]
};
var optionAPI = {
    title: {
        text: '动脉压力容积指数',
        left: "left",
    },
    xAxis: {
        type: 'value',
        name: "年龄/岁",
        axisLine: {
            onZero: true
        },
        min: "20"
    },
    yAxis: {
        type: 'value',
        name: 'API值',
        max: 60
    },
    tooltip: {
        //     trigger: "axis",
        //     axisPointer: {
        //         animation: false
        //     }
        formatter: "动脉压力容积指数api:" + api
    },
    legend: {
        data: ["平均值", "上限值"],
        x: "right"
    },
    // toolbox: {
    //     feature: {
    //         saveAsImage: {}
    //     }
    // },
    axisPointer: {
        link: {
            xAxisIndex: "all"
        }
    },
    grid: [{
        left: 50,
        right: 60,
        top: 50,
        bottom: 60
    }],
    series: [{
        // markPoint: {
        //     data: [{
        //         name: '当前',
        //         value: dataAPI.middle[chartAge][1],
        //         xAxis: dataAPI.middle[chartAge][0],
        //         yAxis: dataAPI.middle[chartAge][1]
        //     }, ]
        // },
        color: "green",
        name: "平均值",
        hoverAnimation: false,
        data: dataAPI.middle,
        symbol: 'none',
        type: 'line'
    },
    {
        color: "blue",
        name: "上限值",
        hoverAnimation: false,
        data: dataAPI.high,
        symbol: 'none',
        type: 'line'
    },
        // {
        //     symbolSize: 8,
        //     data: [apiPoint],
        //     color: "#0000ff",
        //     type: 'scatter'
        // }
    ]
};

echarts.init(document.getElementById("view1")).setOption(optionAVI);
echarts.init(document.getElementById("view2")).setOption(optionAPI);